let data = ['Засгийн', 'газарт', '6.4', 'сая', 'тонн', 'нүүрс', 'алдагдсан', 'гэх', 'мэдээлэл', 'ирээгүй', 'байна.', 'Бодит', 'байдалд', 'ийм', 'их', 'хэмжээний', 'нүүрс', 'алдагдсан', 'гэх', 'асуудал', 'эргэлзээтэй', 'байна.', 'Хууль', 'хяналтын', 'байгууллага', 'хяналт', 'шалгалтын', 'ажил', 'явуулж', 'байна'];
let input = prompt("Өгүүлбэр дэх үгийг өгнө үү?");

let sum = 0;
for(let i = 0; i < data.length; i++){
    if(input.toLocaleLowerCase() == data[i].toLocaleLowerCase()){
        sum = sum + 1;
    }
}
console.log(`${input} гэдэг үг ${sum} удаа орсон байна.`);